//console.log('привет');
/*Задать температуру в градусах по Цельсию. Вывести в alert соответствующую температуру в
градусах по Фаренгейту. Подсказка: расчёт идёт по формуле: Tf = (9 / 5) * Tc + 32, где Tf –
температура по Фаренгейту, Tc – температура по Цельсию
2. Работа с переменными.
3. Объявить две переменные: admin и name. Записать в name строку "Василий"; Скопировать
значение из name в admin. Вывести admin (должно вывести «Василий»).
4. * Чему будет равно JS-выражение 1000 + "108"; */

/*var Tf;
var Tc;
Tc = prompt("Задай температуру по цельсию", 0);
Tf = (9 / 5) * Tc + 32;
alert( Tf.toFixed(1) );
*/

/*var admin;
var name;
name = "Василий";
admin = name;
alert (admin);
*/

//alert (1000+"108");
